tap "anomalyco/tap"
tap "coursier/formulas"
tap "daipeihust/tap"
tap "dart-lang/dart"
tap "homebrew/services"
tap "laishulu/homebrew"
tap "multica-ai/tap"
tap "riscv-software-src/riscv"
tap "sass/sass"
tap "steipete/tap"
# C++ Common Libraries
brew "abseil"
# Language server for NASM/GAS/GO Assembly
brew "asm-lsp"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Core application library for C
brew "glib"
# Extremely Fast Compression algorithm
brew "lz4"
# Extremely fast non-cryptographic hash algorithm
brew "xxhash"
# General-purpose data compression with high compression ratio
brew "xz"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Object-file caching compiler wrapper
brew "ccache"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Generate documentation for several programming languages
brew "doxygen"
# Speech synthesizer that supports more than hundred languages and accents
brew "espeak-ng"
# Modern, maintained replacement for ls
brew "eza"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# PDF reader for terminal emulators using the Kitty image protocol
brew "fancy-cat"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Compression/decompression library aiming for high speed
brew "snappy"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg", link: false
# Port of OpenAI's Whisper model in C/C++
brew "whisper-cpp"
# Play, record, convert, and stream many audio and video codecs
brew "ffmpeg-full", link: true
# Collection of GNU find, xargs, and locate
brew "findutils"
# I/O benchmark and stress test
brew "fio"
# Generic library support script
brew "libtool"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GNU debugger
brew "gdb"
# Library for processing command-line flags
brew "gflags"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Source code tag system
brew "global"
# GNU implementation of time utility
brew "gnu-time"
# Command-driven, interactive function plotting
brew "gnuplot"
# Multi-threaded malloc() and performance analysis tools
brew "gperftools"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Framework for distributed processing of large data sets
brew "hadoop"
# Command-line hex viewer
brew "hexyl"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Tools and libraries to manipulate images in many formats
brew "imagemagick-full"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# ELF object file access library
brew "libelf"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# Postgres C API library
brew "libpq"
# Next-gen compiler infrastructure
brew "llvm"
# LLVM Project Linker
brew "lld"
# Next-gen compiler infrastructure
brew "llvm@14"
# Utility for directing compilation
brew "make"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Small build system for use with gyp or CMake
brew "ninja"
# Use NeoVim as a pager to view manpages, diffs, etc.
brew "nvimpager"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Command-line tools for MySQL, MariaDB and system tasks
brew "percona-toolkit"
# Highly capable, feature-rich programming language
brew "perl"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Show ps output as a tree
brew "pstree"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Easily download, build, install, upgrade, and uninstall Python packages
brew "python-setuptools"
# Generic machine emulator and virtualizer
brew "qemu"
# Rsync for cloud storage
brew "rclone"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# SVG rendering tool and library
brew "resvg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# GNU debugger for riscv64-elf cross development
brew "riscv64-elf-gdb"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# SMART hard drive monitoring
brew "smartmontools"
# Non-interactive SSH password auth
brew "sshpass"
# System performance benchmark tool
brew "sysbench"
# Tool Command Language
brew "tcl-tk"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Simple terminal image viewer written in Rust
brew "viu"
# Internet file retriever
brew "wget"
# Cross-platform libraries and tools for efficient I/O and low-level control
brew "xnvme"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# The AI coding agent built for the terminal.
brew "anomalyco/tap/opencode", trusted: true
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Configuration manager for AI coding agents
cask "cc-switch"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Reimagine your terminal
cask "fig"
cask "font-fira-code"
cask "font-iosevka-nerd-font"
cask "font-symbols-only-nerd-font"
# Font manager
cask "fontbase"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Break time reminder app
cask "lookaway"
# Open-source software for live streaming and screen recording
cask "obs"
# Standalone client for sing-box, the universal proxy platform
cask "sfm"
# Mesh VPN based on WireGuard
cask "tailscale-app"
vscode "13xforever.language-x86-64-assembly"
vscode "aaron-bond.better-comments"
vscode "abusaidm.html-snippets"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "anthropic.claude-code"
vscode "austin.code-gnu-global"
vscode "batisteo.vscode-django"
vscode "brandonjmatthews.one-dark-dark-plus"
vscode "budparr.language-hugo-vscode"
vscode "burkeholland.simple-react-snippets"
vscode "celianriboulet.webvalidator"
vscode "codezombiech.gitignore"
vscode "coenraads.bracket-pair-colorizer-2"
vscode "cschlosser.doxdocgen"
vscode "danielpinto8zz6.c-cpp-compile-run"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "donjayamanne.git-extension-pack"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "eirikpre.systemverilog"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gokturksm.nebula-pandas"
vscode "golang.go"
vscode "hbenl.vscode-test-explorer"
vscode "hoovercj.vscode-power-mode"
vscode "james-yu.latex-workshop"
vscode "jaseci-labs.jac"
vscode "jaycetyle.vscode-gnu-global"
vscode "jeff-hykin.better-cpp-syntax"
vscode "josetr.cmake-language-support-vscode"
vscode "kevinkyang.auto-comment-blocks"
vscode "kevinrose.vsc-python-indent"
vscode "leetcode.vscode-leetcode"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "manasxx.background-cover"
vscode "maziac.asm-code-lens"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-zh-hans"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-modernize"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.gather"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-audio"
vscode "mshr-h.veriloghdl"
vscode "msjsdiag.vscode-react-native"
vscode "njpwerner.autodocstring"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "ortsacnivek.rasa-tools"
vscode "parthr2031.colorful-comments"
vscode "peterj.proto"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "sergey-tihon.openxml-explorer"
vscode "shalldie.background"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "sidthesloth.html5-boilerplate"
vscode "sirtori.indenticator"
vscode "sst-dev.opencode"
vscode "streetsidesoftware.code-spell-checker"
vscode "sukumo28.wav-preview"
vscode "tabnine.tabnine-vscode"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "tht13.html-preview-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "typescriptteam.native-preview"
vscode "typings.vscode-typings"
vscode "uctakeoff.vscode-counter"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vomout.latex-workshop-sanity"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "waderyan.gitblame"
vscode "wakatime.vscode-wakatime"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wraith13.bracket-lens"
vscode "xabikos.javascriptsnippets"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zhuangtongfa.material-theme"
vscode "zhwu95.riscv"
vscode "zignd.html-css-class-completion"
vscode "ziyasal.vscode-open-in-github"
go "flyio-broadcast"
go "flyio-counter"
go "flyio-kafka"
go "flyio-txn"
go "golang.org/x/tools/gopls"
go "maelstrom-echo"
go "maelstrom-unique-ids"
cargo "cargo-modules"
cargo "cargo-nextest"
cargo "cargo-semver-checks"
cargo "flamegraph"
cargo "lalrpop"
cargo "mdbook"
cargo "mdbook-toc"
cargo "tree-sitter-cli"
cargo "workshop-runner"
cargo "zeroclawlabs"
uv "docling", with: ["mlx-vlm"]
uv "graphifyy[gemini]"
uv "kimi-cli"
uv "powermem[mcp,seekdb,server]"
npm "@llamaindex/liteparse"
npm "@openai/codex"
npm "corepack"
npm "oh-my-codex"
